app/views/player/compare.html.erb

SELECT  "records".* FROM "records" WHERE "records"."player_id" = ?  ORDER BY "records"."id" ASC LIMIT 1 OFFSET 1  [["player_id", 581]]
---
      <tr>
        <% p1 = @player1.records.first %>