app/controllers/player_controller.rb

SELECT  "players".* FROM "players" WHERE "players"."webId" = ? LIMIT 1  [["webId", 1414]]
---
	def odi_info
		@player = Player.find_by_webId(params[:id])

SELECT  "players".* FROM "players" WHERE (name LIKE '%%')  ORDER BY "players"."id" ASC LIMIT 1
---
	 def autocomplete_player_name
	 		@all_players=Player.where("name LIKE '%#{params[:term]}%'")

SELECT  "players".* FROM "players" WHERE "players"."webId" = ? LIMIT 1  [["webId", 1414]]
---
	def t20_info
		@player = Player.find_by_webId(params[:id])

SELECT  "players".* FROM "players" WHERE "players"."webId" = ? LIMIT 1  [["webId", 1414]]
SELECT  "records".* FROM "records" WHERE "records"."player_id" = ?  ORDER BY "records"."id" ASC LIMIT 1  [["player_id", 581]]
---
	def test_info
		@player = Player.find_by_webId(params[:id])
		respond_to do |format|
		format.json {
			json2 = @player.records.first.to_json(:only => [:four,:six,:sr,:avg])

SELECT  "players".* FROM "players" WHERE (name LIKE '%virat kohli%')  ORDER BY "players"."id" ASC LIMIT 1
---
	def set_players
		@player1 = Player.where("name LIKE '%#{params[:p1]}%'").first

SELECT  "records".* FROM "records" WHERE "records"."player_id" = ?  ORDER BY "records"."id" ASC LIMIT 1 OFFSET 2  [["player_id", 581]]
---
	 def set_records
	 	@p1TestRecord =@player1.records.first